<template>
  <div id="app">
    <h1>来一点句子🍊吧</h1>
    <div>点击句子🍊切换</div>
    <div id="nav">
      <router-link to="/dh">动画</router-link> |
      <router-link to="/mh">漫画</router-link> |
      <router-link to="/yx">游戏</router-link> |
      <router-link to="/wx">文学</router-link> |
      <router-link to="/ys">影视</router-link> |
      <router-link to="/sc">诗词</router-link> |
      <router-link to="/wyy">网易云</router-link> |
      <router-link to="/zx">哲学</router-link>
    </div>
    <router-view />
    <div id="aplayer">
      <aplayer
        showLrc
        :music="{
          title: '新娘阿花',
          artist: '金玟岐',
          src: 'http://music.163.com/song/media/outer/url?id=1386737233.mp3',
          pic:
            'https://p2.music.126.net/JmHM1whWmWfqqwGEsfFwIA==/109951165154251874.jpg?param=130y130',
          lrc:
            '[00:00.000] 作词 : 金玟岐\n[00:01.000] 作曲 : 金玟岐\n[00:16.30]阿花今年二十八\n[00:20.20]家人催她谈婚论嫁\n[00:24.11]相亲对象他叫做阿发\n[00:27.41]有房有车子还有真皮沙发\n[00:32.07]阿花初次见阿发\n[00:35.79]没有面红心跳只是尴尬\n[00:39.98]阿发自荐今年三十加\n[00:43.28]工作稳定该有个家\n[00:46.82]后来故事发展也没差\n[00:51.12]阿花为他穿上了洁白的纱\n[00:54.75]那个人不是旧爱志明啊\n[00:58.85]也不是刻骨铭心的阿忠呀\n[01:02.55]祝福她祝福她\n[01:06.43]就算王子不是骑着白马\n[01:10.38]也值得去拥有幸福啊\n[01:14.74]不管粗茶淡饭富贵与荣华\n[01:18.20]祝福她新娘阿花\n[01:21.91]少女的梦就寄存在昨天啦\n[01:26.02]那些爱的代价扎成捧花\n[01:30.77]抛出去换个新的她 住新的家\n[01:52.79]阿发牵起了阿花\n[01:56.74]无名指闪耀着那誓言啊\n[02:00.63]一生一世不过转眼一霎\n[02:04.54]结发同行吧\n[02:07.59]后来故事发展也不差\n[02:11.72]三菜一汤阿花等阿发回家\n[02:15.31]两个人依偎在那沙发\n[02:19.56]看一看电影也会聊聊八卦\n[02:25.17]祝福她祝福她\n[02:29.08]就算王子不是骑着白马\n[02:32.97]也值得去拥有幸福啊\n[02:37.36]不管粗茶淡饭富贵与荣华\n[02:40.80]祝福她新娘阿花\n[02:44.46]少女的梦就寄存在昨天啦\n[02:48.57]那些爱的代价扎成捧花\n[02:53.48]抛出去换个新的她\n[02:56.43]祝福她祝福她\n[03:00.33]就算王子不是骑着白马\n[03:04.39]也值得去拥有幸福啊\n[03:08.67]不管粗茶淡饭富贵与荣华\n[03:12.17]祝福她新娘阿花\n[03:15.87]少女的梦就寄存在昨天啦\n[03:19.87]那些爱的代价扎成捧花\n[03:24.76]抛出去换个新的她 住新的家\n[03:31.12]阿花今年六十八\n[03:35.62]她最近爱上了种花\n[03:40.12]阿发清晨买早餐回家\n[03:43.91]豆浆热热的开雾花\n',
        }"
        preload="auto"
        volume="0.3"
        theme="#FADFA3"
      />
    </div>
  </div>
</template>

<script>
import aplayer from "vue-aplayer";
export default {
  components: {
    aplayer,
  },
};
</script>

<style>
#app {
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
}

#nav {
  padding: 30px;
}

#nav a {
  font-weight: bold;
  color: #2c3e50;
}

#nav a.router-link-exact-active {
  color: #42b983;
}

#aplayer {
  /* margin: 100px 0px; */
  padding: 30px 400px;
}
</style>
